#include <unistd.h>

int main(int ac, char *av[]) //добавляем 3 пробела между словами
{
    int i = 0;
    int flag = 0; //флаг для поиска пробелов

    if(ac == 2)
    {
        while(av[1][i] == ' ' || av[1][i] == '\t') //пропускаем пробелы в начале строки
            i++;
        while(av[1][i]) //пока строка
        {
            if(av[1][i] == ' ' || av[1][i] == '\t') //если пробел или таб , то
                flag = 1; //ставим флаг
            else //если не пробел и таб
            {
                if(flag) //и флаг в 1
                    write(1, "   ", 3); //то ставим 3 пробела
                flag = 0; //обнуляем флаг
                write(1, &av[1][i], 1); //выводим символ
            }
            i++; //идем дальше
        }
    }
    write(1, "\n", 1);
    return(0);
}