#include <unistd.h>

int main(int ac, char *av[]) // есть ли в строке подстрока
{
    int i = 0;
    int j = 0;

    if(ac == 3)
    {
        while(av[2][j] && av[1][i]) //пока первая и вторая строка не дошли до конца
        {
            if(av[2][j] == av[1][i]) //если символ во второй строке равен символу в первой
                i++; //двигаем символ 1 строки
            j++; //и символ 2й
        }
        if(av[1][i] == '\0') //если первая строка дошла до конца
            write(1, "1", 1); //печатаем 1
        else //если не дошла
            write(1, "0", 1); //печатаем 0
    }
    write(1, "\n", 1);
    return(0);
}